using System;

namespace Kogane
{
	/// <summary>
	/// デバッグパネルのデータを管理するクラス
	/// </summary>
	public sealed class UDPData
	{
		//====================================================================================
		// プロパティ
		//====================================================================================
		public string Text    { get; }
		public Action OnClick { get; }

		//====================================================================================
		// 関数
		//====================================================================================
		public UDPData
		(
			string text,
			Action onClick
		)
		{
			Text    = text;
			OnClick = onClick;
		}
	}
}